bench/results/20260917T195041Z-cursor/raw/heavy/api/bun/round1/mix-r2000.wrk2.txt
Running 10s test @ http://127.0.0.1:18401
  1 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.21ms    0.96ms  26.21ms   93.95%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.15ms
 75.000%    1.56ms
 90.000%    1.91ms
 99.000%    2.53ms
 99.900%   18.46ms
 99.990%   25.98ms
 99.999%   26.22ms
100.000%   26.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.085     0.000000            1         1.00
       0.493     0.100000         1899         1.11
       0.686     0.200000         3782         1.25
       0.842     0.300000         5661         1.43
       0.995     0.400000         7550         1.67
       1.147     0.500000         9430         2.00
       1.221     0.550000        10368         2.22
       1.297     0.600000        11314         2.50
       1.378     0.650000        12255         2.86
       1.462     0.700000        13213         3.33
       1.557     0.750000        14144         4.00
       1.608     0.775000        14611         4.44
       1.659     0.800000        15080         5.00
       1.712     0.825000        15549         5.71
       1.768     0.850000        16020         6.67
       1.833     0.875000        16493         8.00
       1.871     0.887500        16729         8.89
       1.910     0.900000        16966        10.00
       1.954     0.912500        17200        11.43
       1.998     0.925000        17440        13.33
       2.051     0.937500        17678        16.00
       2.079     0.943750        17792        17.78
       2.111     0.950000        17909        20.00
       2.151     0.956250        18028        22.86
       2.191     0.962500        18141        26.67
       2.243     0.968750        18259        32.00
       2.269     0.971875        18319        35.56
       2.295     0.975000        18376        40.00
       2.323     0.978125        18437        45.71
       2.365     0.981250        18496        53.33
       2.417     0.984375        18553        64.00
       2.439     0.985938        18584        71.11
       2.475     0.987500        18612        80.00
       2.511     0.989062        18642        91.43
       2.563     0.990625        18671       106.67
       2.627     0.992188        18701       128.00
       2.671     0.992969        18715       142.22
       2.725     0.993750        18730       160.00
       2.807     0.994531        18746       182.86
       2.873     0.995313        18759       213.33
       3.011     0.996094        18774       256.00
       3.119     0.996484        18781       284.44
       3.329     0.996875        18789       320.00
       3.503     0.997266        18796       365.71
       4.065     0.997656        18803       426.67
       9.215     0.998047        18811       512.00
      12.015     0.998242        18814       568.89
      12.855     0.998437        18818       640.00
      14.247     0.998633        18822       731.43
      15.191     0.998828        18825       853.33
      18.943     0.999023        18829      1024.00
      19.695     0.999121        18831      1137.78
      20.175     0.999219        18833      1280.00
      21.599     0.999316        18835      1462.86
      21.823     0.999414        18836      1706.67
      23.791     0.999512        18838      2048.00
      24.655     0.999561        18839      2275.56
      24.735     0.999609        18840      2560.00
      24.751     0.999658        18841      2925.71
      25.071     0.999707        18842      3413.33
      25.231     0.999756        18843      4096.00
      25.231     0.999780        18843      4551.11
      25.583     0.999805        18844      5120.00
      25.583     0.999829        18844      5851.43
      25.983     0.999854        18845      6826.67
      25.983     0.999878        18845      8192.00
      25.983     0.999890        18845      9102.22
      26.063     0.999902        18846     10240.00
      26.063     0.999915        18846     11702.86
      26.063     0.999927        18846     13653.33
      26.063     0.999939        18846     16384.00
      26.063     0.999945        18846     18204.44
      26.223     0.999951        18847     20480.00
      26.223     1.000000        18847          inf
#[Mean    =        1.213, StdDeviation   =        0.964]
#[Max     =       26.208, Total count    =        18847]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18848 requests in 10.00s, 10.97MB read
Requests/sec:   1885.02
Transfer/sec:      1.10MB
MIX_ERRORS connect=0 read=0 write=0 status=0 timeout=0