bench/results/20260917T195041Z-cursor/raw/heavy/api/bun/round1/warmup.txt
Running 3s test @ http://127.0.0.1:18401
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.35ms   13.80ms 167.02ms   96.42%
    Req/Sec    21.73k     6.24k   27.25k    87.10%
  67007 requests in 3.10s, 36.36MB read
Requests/sec:  21628.07
Transfer/sec:     11.74MB
MIX_ERRORS connect=0 read=0 write=0 status=0 timeout=0